#+PROPERTY: header-args:coq  :session *Coq*

** Generation of backend output
# #+begin_src fundamental :tangle _CoqProject :eval never
#   -R ../../../coq/src/ Hacspec
#   -arg -w
#   -arg all

#   ../../../coq/src/MachineIntegers.v
#   ../../../coq/src/Lib.v
#   ../../../coq/src/QuickChickLib.v
# #+end_src

#+begin_src sh :results none
  cargo hacspec -o Auction.v auction --update
#+end_src

#+begin_src emacs-lisp :results none
  ;; (setq coq-project-filename "_CoqProject")
  ;; ((coq-mode . ((coq-project-filename . "_CoqProject"))))
  ((coq-mode
    .
    ((eval
      .
      (progn 
	(make-local-variable 'coq-project-filename)
	(setq coq-project-filename  "_CoqProject"))))))
#+end_src

# (setq coq-load-path '((rec "/home/au538501/Documents/LocalHacspec/hacspec/coq/src/" "Hacspec")))
# (setq coq-load-path-include-current 1)
# (add-to-list 'load-path (expand-file-name (file-name-directory (or load-file-name buffer-file-name))))
# :eval never

#+name: lines
#+begin_src sh :wrap "src coq :tangle Auction.v" :exports results :eval no-export :results output raw :var ARG="1,10p;11q"
  sed -n $ARG Auction.v
#+end_src

#+CALL: lines(ARG="1,10p;11q")

#+RESULTS:
#+begin_src coq :tangle Auction.v
(** This file was automatically generated using Hacspec **)
Require Import Lib MachineIntegers.
From Coq Require Import ZArith.
Import List.ListNotations.
Open Scope Z_scope.
Open Scope bool_scope.
Open Scope hacspec_scope.
From QuickChick Require Import QuickChick.
Require Import QuickChickLib.
Require Import Hacspec.Lib.
#+end_src

#+RESULTS:
#+begin_example
(** This file was automatically generated using Hacspec **)
Require Import Lib MachineIntegers.
From Coq Require Import ZArith.
Import List.ListNotations.
Open Scope Z_scope.
Open Scope bool_scope.
Open Scope hacspec_scope.
From QuickChick Require Import QuickChick.
Require Import QuickChickLib.
Require Import Hacspec.Lib.
#+end_example

#+CALL: lines(ARG="12,200p;201q")

#+RESULTS:
#+begin_src coq :tangle Auction.v
Definition user_address := nseq (int8) (usize 32).

Inductive auction_state :=
| NotSoldYet : auction_state
| Sold : user_address -> auction_state.

Definition eqb_auction_state (x y : auction_state) : bool :=
match x with
   | NotSoldYet => match y with | NotSoldYet=> true | _ => false end
   | Sold a => match y with | Sold b => a =.? b | _ => false end
   end.

Definition eqb_leibniz_auction_state (x y : auction_state) : eqb_auction_state x y = true <-> x = y.
Proof. split. intros; destruct x ; destruct y ; try (f_equal ; apply eqb_leibniz) ; easy. intros ; subst ; destruct y ; try reflexivity ; try (apply eqb_refl). Qed.

Instance eq_dec_auction_state : EqDec (auction_state) :=
Build_EqDec (auction_state) (eqb_auction_state) (eqb_leibniz_auction_state).

 Global Instance show_auction_state : Show (auction_state) :=
  @Build_Show (auction_state) (fun x =>
 match x with
 NotSoldYet => ("NotSoldYet")%string
 | Sold a => ("Sold" ++ show a)%string
 end).
Definition g_auction_state : G (auction_state) := oneOf_ (returnGen NotSoldYet) [returnGen NotSoldYet;bindGen arbitrary (fun a => returnGen (Sold a))].
#[global] Instance gen_auction_state : Gen (auction_state) := Build_Gen auction_state g_auction_state.


Inductive seq_map :=
| SeqMap : (public_byte_seq × public_byte_seq) -> seq_map.

Definition eqb_seq_map (x y : seq_map) : bool :=
match x with
   | SeqMap a => match y with | SeqMap b => a =.? b end
   end.

Definition eqb_leibniz_seq_map (x y : seq_map) : eqb_seq_map x y = true <-> x = y.
Proof. split. intros; destruct x ; destruct y ; try (f_equal ; apply eqb_leibniz) ; easy. intros ; subst ; destruct y ; try reflexivity ; try (apply eqb_refl). Qed.

Instance eq_dec_seq_map : EqDec (seq_map) :=
Build_EqDec (seq_map) (eqb_seq_map) (eqb_leibniz_seq_map).

 Global Instance show_seq_map : Show (seq_map) :=
  @Build_Show (seq_map) (fun x =>
 match x with
 SeqMap a => ("SeqMap" ++ show a)%string
 end).
Definition g_seq_map : G (seq_map) := oneOf_ (bindGen arbitrary (fun a => returnGen (SeqMap a))) [bindGen arbitrary (fun a => returnGen (SeqMap a))].
#[global] Instance gen_seq_map : Gen (seq_map) := Build_Gen seq_map g_seq_map.


Notation "'amount'" := (int64) : hacspec_scope.

Notation "'timestamp'" := (int64) : hacspec_scope.

Notation "'itemtyp'" := (public_byte_seq) : hacspec_scope.

Inductive state :=
| State : (auction_state × amount × itemtyp × timestamp × seq_map) -> state.

Definition eqb_state (x y : state) : bool :=
match x with
   | State a => match y with | State b => a =.? b end
   end.

Definition eqb_leibniz_state (x y : state) : eqb_state x y = true <-> x = y.
Proof. split. intros; destruct x ; destruct y ; try (f_equal ; apply eqb_leibniz) ; easy. intros ; subst ; destruct y ; try reflexivity ; try (apply eqb_refl). Qed.

Instance eq_dec_state : EqDec (state) :=
Build_EqDec (state) (eqb_state) (eqb_leibniz_state).

 Global Instance show_state : Show (state) :=
  @Build_Show (state) (fun x =>
 match x with
 State a => ("State" ++ show a)%string
 end).
Definition g_state : G (state) := oneOf_ (bindGen arbitrary (fun a => returnGen (State a))) [bindGen arbitrary (fun a => returnGen (State a))].
#[global] Instance gen_state : Gen (state) := Build_Gen state g_state.


Definition fresh_state (itm_0 : itemtyp) (exp_1 : int64) : state :=
  State ((
      NotSoldYet,
      @repr WORDSIZE64 0,
      itm_0,
      exp_1,
      SeqMap ((
	  seq_new_ (@repr WORDSIZE8 0) (usize 0),
	  seq_new_ (@repr WORDSIZE8 0) (usize 0)
	))
    )).

Theorem ensures_fresh_state : forall result_2 (itm_0 : itemtyp) (exp_1 : int64),
 @fresh_state itm_0 exp_1 = result_2 ->
 true.
 Proof. Admitted.

Definition seq_map_entry
  (m_3 : seq_map)
  (sender_address_4 : user_address)
  : (int64 × seq_map) :=
  let 'SeqMap ((m0_5, m1_6)) :=
    m_3 in 
  let res_7 : (int64 × seq_map) :=
    (
      @repr WORDSIZE64 0,
      SeqMap ((
	  seq_concat ((m0_5)) (sender_address_4),
	  seq_concat ((m1_6)) (u64_to_be_bytes (@repr WORDSIZE64 0))
	))
    ) in 
  let res_7 :=
    foldi (usize 0) ((seq_len ((m0_5))) / (usize 32)) (fun x_8 res_7 =>
      let '(res_7) :=
	if (array_from_seq (32) (seq_slice ((m0_5)) ((x_8) * (usize 32)) (
	      usize 32))) array_eq (sender_address_4):bool then (let res_7 :=
	    (
	      u64_from_be_bytes (array_from_seq (8) (seq_slice ((m1_6)) ((
		      x_8) * (usize 8)) (usize 8))),
	      SeqMap (((m0_5), (m1_6)))
	    ) in 
	  (res_7)) else ((res_7)) in 
      (res_7))
    res_7 in 
  res_7.

Inductive map_update :=
| Update : (int64 × seq_map) -> map_update.

Definition eqb_map_update (x y : map_update) : bool :=
match x with
   | Update a => match y with | Update b => a =.? b end
   end.

Definition eqb_leibniz_map_update (x y : map_update) : eqb_map_update x y = true <-> x = y.
Proof. split. intros; destruct x ; destruct y ; try (f_equal ; apply eqb_leibniz) ; easy. intros ; subst ; destruct y ; try reflexivity ; try (apply eqb_refl). Qed.

Instance eq_dec_map_update : EqDec (map_update) :=
Build_EqDec (map_update) (eqb_map_update) (eqb_leibniz_map_update).

 Global Instance show_map_update : Show (map_update) :=
  @Build_Show (map_update) (fun x =>
 match x with
 Update a => ("Update" ++ show a)%string
 end).
Definition g_map_update : G (map_update) := oneOf_ (bindGen arbitrary (fun a => returnGen (Update a))) [bindGen arbitrary (fun a => returnGen (Update a))].
#[global] Instance gen_map_update : Gen (map_update) := Build_Gen map_update g_map_update.


Definition seq_map_update_entry
  (m_9 : seq_map)
  (sender_address_10 : user_address)
  (amount_11 : int64)
  : map_update :=
  let 'SeqMap ((m0_12, m1_13)) :=
    m_9 in 
  let res_14 : map_update :=
    Update ((
	amount_11,
	SeqMap ((
	    seq_concat ((m0_12)) (sender_address_10),
	    seq_concat ((m1_13)) (u64_to_be_bytes (amount_11))
	  ))
      )) in 
  let res_14 :=
    foldi (usize 0) ((seq_len ((m0_12))) / (usize 32)) (fun x_15 res_14 =>
      let '(res_14) :=
	if (array_from_seq (32) (seq_slice ((m0_12)) ((x_15) * (usize 32)) (
	      usize 32))) array_eq (sender_address_10):bool then (let res_14 :=
	    Update ((
		amount_11,
		SeqMap ((
		    seq_update ((m0_12)) ((x_15) * (usize 32)) (
		      sender_address_10),
		    seq_update ((m1_13)) ((x_15) * (usize 8)) (u64_to_be_bytes (
			amount_11))
		  ))
	      )) in 
	  (res_14)) else ((res_14)) in 
      (res_14))
    res_14 in 
  res_14.

Inductive bid_error :=
| ContractSender : bid_error
| BidTooLow : bid_error
| BidsOverWaitingForAuctionFinalization : bid_error
| AuctionIsFinalized : bid_error.

#+end_src
